base/InformationRegisters/ВидыСельскохозяйственныхКультурЗЕРНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВидыСельскохозяйственныхКультурЗЕРНО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОКПД2Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТНВЭДНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОКПД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/ВидыСельскохозяйственныхКультурЗЕРНО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает таблицу кодов ТНВЭД, соответствующих переданным кодам ОКПД2.
//
// Параметры:
//  КодыОКПД2 - Строка, Массив из Строка - коды ОКПД2, для которых требуется получить ТНВЭД.
//
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * ОКПД2 - Строка - Исходный ОКПД2.
//   * КодТНВЭД - Строка - Код ТН ВЭД.
//   * Представление - Строка - представление ТН ВЭД.
Функция ДанныеТНВЭДПоОКПД2(КодыОКПД2) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыСельскохозяйственныхКультурЗЕРНО.ОКПД2             КАК ОКПД2,
	|	ВидыСельскохозяйственныхКультурЗЕРНО.КодТНВЭД          КАК КодТНВЭД,
	|	ВидыСельскохозяйственныхКультурЗЕРНО.ТНВЭДНаименование КАК Представление
	|ИЗ
	|	РегистрСведений.ВидыСельскохозяйственныхКультурЗЕРНО КАК ВидыСельскохозяйственныхКультурЗЕРНО
	|ГДЕ
	|	ВидыСельскохозяйственныхКультурЗЕРНО.ОКПД2 В (&ОКПД2)
	|	И (ВидыСельскохозяйственныхКультурЗЕРНО.ДействуетПо >= &Дата
	|		Или ВидыСельскохозяйственныхКультурЗЕРНО.ДействуетПо = ДатаВремя(1,1,1))
	|";
	
	Запрос.УстановитьПараметр("ОКПД2", КодыОКПД2);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Каждого СтрокаРезультата Из Результат Цикл
		СтрокаРезультата.Представление = ИнтеграцияЗЕРНОКлиентСервер.ПредставлениеКодТНВЭД(
			СтрокаРезультата.Представление, СтрокаРезультата.КодТНВЭД);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
